In [31]:
import pandas as pd
import numpy as np

Write a Pandas program to create and display a one-dimensional array-like 
object containing an array of data using Pandas module.

In [8]:
ser=pd.Series([1,2.2,3,"Hello"])
ser

0        1
1      2.2
2        3
3    Hello
dtype: object

Write a Pandas program to convert a Panda module Series to Python list and it's 
type.

In [10]:
series_list=list(ser)
type(series_list)

list

Write a Pandas program to compare the elements of the two Pandas Series.

In [21]:
ser1=pd.Series([1,2,3,4])
ser2=pd.Series([1,2,5,9])
ser1.compare(ser2)

   self  other
2   3.0    5.0
3   4.0    9.0

Write a Pandas program to change the data type of given a column or a Series.

In [22]:
print(ser1.dtype)
ser1=ser1.astype(float)
print(ser1.dtype)

int64
float64

Write a Pandas program to get the powers of an array values element-wise.

In [24]:
ser1.apply(lambda x: x**2)

0     1.0
1     4.0
2     9.0
3    16.0
dtype: float64

In [29]:
sample_data=pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]} )
powers = [2, 3, 4]

sample_data ** powers

      X       Y         Z
0  6084  592704  54700816
1  7225  830584  88529281
2  9216  704969  84934656
3  6400  571787  26873856
4  7396  636056  47458321

Write a Pandas program to get the first 3 rows of a given DataFrame.

In [35]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 
'Matthew', 'Laura', 'Kevin', 'Jonas'], 
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19], 
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1], 
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']} 
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

data=pd.DataFrame(exam_data,labels)
data.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Write a Pandas program to display the default index and set a column as an 
Index in a given dataframe.

In [70]:
test= {'0':[0,1,2,3,4,5],'1':['Streat1','Streat2','Streat3','Streat4','Streat5','Streat6'],'2':['S001','S002','S003','S004','S005','S006'],'3':['V','V','VI','VI','V','VI'],'4':['Alberto','Gino', 'Ryan','Eesha', 'Gino','David'],'5':['15/05/2002','17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],'6':[35,32,33,30,31,32]}
df=pd.DataFrame(test)
df = df.set_index('0')
df

         1     2   3        4           5   6
0
0  Streat1  S001   V  Alberto  15/05/2002  35
1  Streat2  S002   V     Gino  17/05/2002  32
2  Streat3  S003  VI     Ryan  16/02/1999  33
3  Streat4  S004  VI    Eesha  25/09/1998  30
4  Streat5  S005   V     Gino  11/05/2002  31
5  Streat6  S006  VI    David  15/09/1997  32

Write a Pandas program to display the default index and set a column as an 
Index in a given dataframe and then reset the index

In [43]:
df = df.set_index('1')
df

            2   3        4           5   6
1
Streat1  S001   V  Alberto  15/05/2002  35
Streat2  S002   V     Gino  17/05/2002  32
Streat3  S003  VI     Ryan  16/02/1999  33
Streat4  S004  VI    Eesha  25/09/1998  30
Streat5  S005   V     Gino  11/05/2002  31
Streat6  S006  VI    David  15/09/1997  32

In [44]:
df=df.reset_index()
df

         1     2   3        4           5   6
0  Streat1  S001   V  Alberto  15/05/2002  35
1  Streat2  S002   V     Gino  17/05/2002  32
2  Streat3  S003  VI     Ryan  16/02/1999  33
3  Streat4  S004  VI    Eesha  25/09/1998  30
4  Streat5  S005   V     Gino  11/05/2002  31
5  Streat6  S006  VI    David  15/09/1997  32

Write a Pandas program to create a dataframe indexing by date and time.

In [71]:
df = df.set_index('5')
df.head()

                  1     2   3        4   6
5
15/05/2002  Streat1  S001   V  Alberto  35
17/05/2002  Streat2  S002   V     Gino  32
16/02/1999  Streat3  S003  VI     Ryan  33
25/09/1998  Streat4  S004  VI    Eesha  30
11/05/2002  Streat5  S005   V     Gino  31

 Write a Pandas program to create a dataframe and set a title or name of the 
index column.

In [72]:
cols="Date"
df=df.rename_axis(cols,axis='index')
df

                  1     2   3        4   6
Date
15/05/2002  Streat1  S001   V  Alberto  35
17/05/2002  Streat2  S002   V     Gino  32
16/02/1999  Streat3  S003  VI     Ryan  33
25/09/1998  Streat4  S004  VI    Eesha  30
11/05/2002  Streat5  S005   V     Gino  31
15/09/1997  Streat6  S006  VI    David  32

Write a Pandas program to select a specific row of given series/dataframe by 
integer index.

In [73]:
df=df.reset_index()
df

         Date        1     2   3        4   6
0  15/05/2002  Streat1  S001   V  Alberto  35
1  17/05/2002  Streat2  S002   V     Gino  32
2  16/02/1999  Streat3  S003  VI     Ryan  33
3  25/09/1998  Streat4  S004  VI    Eesha  30
4  11/05/2002  Streat5  S005   V     Gino  31
5  15/09/1997  Streat6  S006  VI    David  32

In [81]:
df.loc[2]

Date    16/02/1999
1          Streat3
2             S003
3               VI
4             Ryan
6               33
Name: 2, dtype: object